Revit 2027 API
SolidUtils.FindAllEdgeEndPointsAtVertex Method
 Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<EdgeEndPoint> FindAllEdgeEndPointsAtVertex(
	EdgeEndPoint edgeEndPoint
)
Public Shared Function FindAllEdgeEndPointsAtVertex (
	edgeEndPoint As EdgeEndPoint
) As IList(Of EdgeEndPoint)
public:
static IList<EdgeEndPoint^>^ FindAllEdgeEndPointsAtVertex(
	EdgeEndPoint^ edgeEndPoint
)
static member FindAllEdgeEndPointsAtVertex :
        edgeEndPoint : EdgeEndPoint -> IList<EdgeEndPoint>
Parameters
edgeEndPoint EdgeEndPoint
 The input EdgeEndPoint that identifies the vertex.
Return Value
IList<EdgeEndPoint>
 All EdgeEndPoints at the vertex. The input EdgeEndPoint is also included.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
See Also
Reference
SolidUtils Class
Autodesk.Revit.DB Namespace